# identity-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=yis9ofcshi]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/identity_api]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-identity_api]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=47120b67-9636-4762-b866-310644f33bc0:identity_api]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=kafka_cluster_id]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-859f7989-08e7-4d02-9ab9-a35aa92556ee]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/identity_api]
module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default: Refreshing state... [id=identity_api_endpoint]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-identity_api-20230505205312291800000001]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=f30dda84a5cd4d466f9a276764c58bacdd2a87c7]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=identity_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=f58uel3]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=kugcspo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "identity_api"
        tags                           = {
            "domain"        = "identity"
            "environment"   = "production"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "identity_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "47120b67-9636-4762-b866-310644f33bc0:identity_api"
        name       = "identity_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "a58b3972-a28a-4e05-ada7-e9503fbb2925" -> "f47549f5-67c6-4404-9677-e27b52c02c12"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*